package com.amao.Ademo_kp;

public class Summary {
    /*
    - 能够知道private关键字的特点
    可以修饰成员变量和成员方法,被private修饰的成员变量或者成员方法只能在本类中访问

- 能够知道this关键字的作用
    this关键字可以用来区别同名的成员变量和成员方法
    格式: this.成员变量名

- 能够知道构造方法的格式和注意事项
    public 类名(){}
	public 类名(形参列表){}
	注意:
		1.构造方法没有返回值类型,连void都不能写
        2.构造方法的方法名一定是类名
        3.构造方法可以重载的
        4.如果一个类没有定义构造方法,系统会自动生成一个空参构造方法
          如果定义了构造方法,系统就不会自动生成空参构造方法

- 能够完成一个标准类代码的编写及测试
     成员变量 private
     空参构造
     满参构造
     set方法
     get方法
     成员方法
- 能够知道帮助文档的使用步骤
	1.打开api
    2.点击显示
    3.点击索引
    4.在搜索框中输入要查找的内容,回车
    5.查看包
    6.查看类的解释说明
    7.查看构造方法
    8.查看成员方法
     */
}
