package com.amao.Ademo_KP;

public class Test {
    public static void main(String[] args) {
        /*
            1.集合与数组存储数据概述:
                集合、数组都是对多个数据进行存储操作的结构,简称java容器
                说明:此时的存储,主要指的是内存层面的存储,不仅涉及到持久化的存储
            2.数组存储的特点:
                1.一旦初始化以后,其长度就确定了
                2.数组一旦定义好,其元素的类型也就确定了,我们也就只能操作指定类型的数据
            3.数组存储的弊端:
                1.一旦初始化以后,长度就不可修改
                2.数组中提供的方法非常限,对于添加,删除,插入数据等操作,非常不便,同时效率不高
                3.获取数组中实际元素的个数的需求,数组没有现成的属性或方法可用
                4.数据存储数据的特点: 序:可重复性  对于无序,不可重复的需求不能满足

            4.集合存储的优点:
                能够解决数据存储数据方面的弊端
-----------------------------------------------------------------------------------------------------------

            1.单例集合框架结构
                Collection接口: 单列集合,用来存储一个一个的对象
                         list接口:存储序的,可重复的数据   动态数组
                            ArrayList,LinkedList,Vector
                         set接口:存储无序的,不可重复的数据
                            HashSet,LinkedHashSet,TreeSet

            2.Collection接口常用方法:


         */
    }
}
