package com.amao.Ademo_KP;

public class Summary {
    /*
    - 能够写出类的继承格式
  public class 子类名 extends 父类名{}

- 能够说出继承的特点
   1.继承只能是单继承,不能多继承,可以多层继承
   2.子类可以继承父类的成员变量和成员方法,不能继承父类的构造方法
   3.子类可以直接访问父类的非私有成员,不可以直接访问私有成员

- 能够说出子类调用父类的成员特点
	子类可以直接访问父类的非私有成员,不可以直接访问私有成员

- 够说出方法重写的概念
	父子类中出现了一模一样的方法(返回值类型,方法名,参数列表)
    权限修饰符: 子类重写的方法的权限必须大于或许等于父类的方法权限
    public  > protected  > 默认  > private

- 能够说出this可以解决的问题
	可以区分成员变量和局部变量同名的情况
    this可以访问本类中的成员

- 能够说出super可以解决的问题
	可以区别父子类中的同名的成员变量,同名的成员方法
    super可以访问父类中的成员

- 描述抽象方法的概念
	没有方法体,使用abstract修饰的方法

- 写出抽象类的格式
	public abstract class 类名{}

- 写出抽象方法的格式
	修饰符 abstract 返回值类型 方法名(参数列表);

- 能够说出父类抽象方法的存在意义
	要求子类必须重写
    抽象类的子类: 普通类  抽象类
     */
}
